### CESAR School :: Especialização em Ciência de Dados :: 2024.1
Aula 02 :: xxxxx

Séries Temporais

```
Data: 23 de janeiro de 2025 
Prof.: Pedro Braga
Aluno: Marlos Ribeiro
```

In [3]:
%%bash
mkdir -p ../data
curl -L -o ../data/cinema-ticket.zip\
    https://www.kaggle.com/api/v1/datasets/download/arashnic/cinema-ticket
unzip -n -d ../data ../data/cinema-ticket.zip
rm -f ../data/cinema-ticket.zip

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100 3345k  100 3345k    0     0  1721k      0  0:00:01  0:00:01 --:--:-- 3568k

Archive:  ../data/cinema-ticket.zip
  inflating: ../data/cinemaTicket_Ref.csv

In [4]:
%%bash
uv add pandas

Resolved 38 packages in 178ms
Prepared 2 packages in 377ms
Installed 4 packages in 43ms
 + numpy==2.2.2
 + pandas==2.2.3
 + pytz==2024.2
 + tzdata==2025.1

In [6]:
import pandas as pd

In [8]:
df_cinema = pd.read_csv('../data/cinemaTicket_Ref.csv')
df_cinema.info()
df_cinema.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 142524 entries, 0 to 142523
Data columns (total 14 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   film_code     142524 non-null  int64
 1   cinema_code   142524 non-null  int64
 2   total_sales   142524 non-null  int64
 3   tickets_sold  142524 non-null  int64
 4   tickets_out   142524 non-null  int64
 5   show_time     142524 non-null  int64
 6   occu_perc     142399 non-null  float64
 7   ticket_price  142524 non-null  float64
 8   ticket_use    142524 non-null  int64
 9   capacity      142399 non-null  float64
 10  date          142524 non-null  object
 11  month         142524 non-null  int64
 12  quarter       142524 non-null  int64
 13  day           142524 non-null  int64
dtypes: float64(3), int64(10), object(1)
memory usage: 15.2+ MB

,film_code,cinema_code,total_sales,tickets_sold,tickets_out,show_time,occu_perc,ticket_price,ticket_use,capacity,date,month,quarter,day
0,1492,304,3900000,26,0,4,4.26,150000.0,26,610.328638,2018-05-05,5,2,5
1,1492,352,3360000,42,0,5,8.08,80000.0,42,519.801980,2018-05-05,5,2,5
2,1492,489,2560000,32,0,4,20.00,80000.0,32,160.000000,2018-05-05,5,2,5
3,1492,429,1200000,12,0,1,11.01,100000.0,12,108.991826,2018-05-05,5,2,5
4,1492,524,1200000,15,0,3,16.67,80000.0,15,89.982004,2018-05-05,5,2,5